integration-tests/resources/mirth.wsdl

<?xml version="1.0" encoding="UTF-8"?>
<!-- Published by JAX-WS RI at http://jax-ws.dev.java.net. RI's version is JAX-WS RI 2.2.4-b01. -->
<definitions xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd"
    xmlns:wsp="http://www.w3.org/ns/ws-policy"
    xmlns:wsp1_2="http://schemas.xmlsoap.org/ws/2004/09/policy"
    xmlns:wsam="http://www.w3.org/2007/05/addressing/metadata"
    xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/"
    xmlns:tns="http://ws.connectors.connect.mirth.com/"
    xmlns:xsd="http://www.w3.org/2001/XMLSchema"
    xmlns="http://schemas.xmlsoap.org/wsdl/" targetNamespace="http://ws.connectors.connect.mirth.com/" name="DefaultAcceptMessageService">
    <types>
        <xsd:schema>
            <xsd:import namespace="http://ws.connectors.connect.mirth.com/" schemaLocation="http://wiremock:8080/services/Mirth?xsd=1"></xsd:import>
        </xsd:schema>
    </types>
    <message name="acceptMessage">
        <part name="parameters" element="tns:acceptMessage"></part>
    </message>
    <message name="acceptMessageResponse">
        <part name="parameters" element="tns:acceptMessageResponse"></part>
    </message>
    <portType name="DefaultAcceptMessage">
        <operation name="acceptMessage">
            <input wsam:Action="http://ws.connectors.connect.mirth.com/DefaultAcceptMessage/acceptMessageRequest" message="tns:acceptMessage"></input>
            <output wsam:Action="http://ws.connectors.connect.mirth.com/DefaultAcceptMessage/acceptMessageResponse" message="tns:acceptMessageResponse"></output>
        </operation>
    </portType>
    <binding name="DefaultAcceptMessagePortBinding" type="tns:DefaultAcceptMessage">
        <soap:binding transport="http://schemas.xmlsoap.org/soap/http" style="document"></soap:binding>
        <operation name="acceptMessage">
            <soap:operation soapAction=""></soap:operation>
            <input>
                <soap:body use="literal"></soap:body>
            </input>
            <output>
                <soap:body use="literal"></soap:body>
            </output>
        </operation>
    </binding>
    <service name="DefaultAcceptMessageService">
        <port name="DefaultAcceptMessagePort" binding="tns:DefaultAcceptMessagePortBinding">
            <soap:address location="http://wiremock:8080/services/Mirth"></soap:address>
        </port>
    </service>
</definitions>
